###############################################################################
# Taps
###############################################################################

###############################################################################
# Formulae
###############################################################################

# Run your GitHub Actions locally
brew "act"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# Embeddable SQL OLAP Database Management System
brew "duckdb"

# Distributed revision control system
brew "git"

# GitHub command-line tool
brew "gh"

# Like cURL, but for gRPC
brew "grpcurl"

# Polyglot runtime manager (asdf rust clone)
brew "mise"

# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"

# Kubernetes package manager
brew "helm"

# Kubernetes command-line interface
brew "kubernetes-cli"

# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"

# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"

# Run local Kubernetes cluster in Docker
brew "kind"

# CLI for managing Apache Kafka
brew "kafkactl"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"

# Cross-shell prompt for astronauts
brew "starship"

# YAML Parser
brew "libyaml"

# Protocol buffers (Google's data interchange format)
brew "protobuf"

# Scalable batch and stream data processing
brew "apache-flink"

###############################################################################
# Casks
###############################################################################

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", greedy: true

# Voice and text chat software
cask "discord"

# App to build and share containerised applications and microservices
cask "docker-desktop", greedy: true

# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli", postinstall: "${HOMEBREW_PREFIX}/bin/gcloud components update"

# Web browser
cask "firefox", greedy: true

# Web browser
cask "google-chrome", greedy: true

# Chromium based browser
cask "arc", greedy: true

# Open-source code editor
cask "visual-studio-code", greedy: true

# Video communication and virtual meeting platform
cask "zoom", greedy: true

# VPN client
cask "private-internet-access", greedy: true

# Music streaming service
cask "spotify", greedy: true

# Screenshot measurement and annotation tool
cask "shottr", greedy: true

# Native GUI tool for relational databases
cask "tableplus", greedy: true

# Terminal-based AI coding assistant
cask "claude-code", greedy: true

# Fonts
cask "font-hack-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"

###############################################################################
# VS Code
###############################################################################

vscode "aquasecurityofficial.trivy-vulnerability-scanner"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "sanjulaganepola.github-local-actions"
vscode "mhutchie.git-graph"
vscode "redhat.vscode-yaml"
vscode "usernamehw.errorlens"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.python"
vscode "tamasfe.even-better-toml"
vscode "mechatroner.rainbow-csv"
vscode "oderwat.indent-rainbow"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "streetsidesoftware.code-spell-checker"

###############################################################################
# Mac App Store
###############################################################################

